# Curve Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SlabShapeCrease..::..Curve Property
SlabShapeCrease Class See Also
---
The geometry of the crease.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Curve Curve { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Curve As Curve
	Get
```

Visual C++
---
```text
public:
property Curve^ Curve {
	Curve^ get ();
}
```

# See Also
SlabShapeCrease Class
Autodesk.Revit.DB Namespace